In [1]:
import numpy as np
import pandas as pd

In [2]:
col_name=['user_id','item_id','ratting','timestamp']

In [21]:
df=pd.read_csv('u.data',sep='\t',names=col_name)

In [22]:
df.head()

   user_id  item_id  ratting  timestamp
0        0       50        5  881250949
1        0      172        5  881250949
2        0      133        1  881250949
3      196      242        3  881250949
4      186      302        3  891717742

In [5]:
df.describe()

             user_id        item_id        ratting     timestamp
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [23]:
movie_title=pd.read_csv('Movie_Id_Titles')

In [24]:
movie_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [25]:
df=pd.merge(df,movie_title,on='item_id')

In [26]:
df.head()

   user_id  item_id  ratting  timestamp             title
0        0       50        5  881250949  Star Wars (1977)
1      290       50        5  880473582  Star Wars (1977)
2       79       50        4  891271545  Star Wars (1977)
3        2       50        5  888552084  Star Wars (1977)
4        8       50        5  879362124  Star Wars (1977)

In [28]:
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [29]:
sns.set_style('white')

In [34]:
df.groupby('title')['ratting'].mean().sort_values(ascending=False)

title
They Made Me a Criminal (1939)                  5.0
Marlene Dietrich: Shadow and Light (1996)       5.0
Saint of Fort Washington, The (1993)            5.0
Someone Else's America (1995)                   5.0
Star Kid (1997)                                 5.0
                                               ...
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
King of New York (1990)                         1.0
Touki Bouki (Journey of the Hyena) (1973)       1.0
Bloody Child, The (1996)                        1.0
Crude Oasis, The (1995)                         1.0
Name: ratting, Length: 1664, dtype: float64

In [36]:
df.groupby('title')['ratting'].count().sort_values(ascending=False)

title
Star Wars (1977)                      584
Contact (1997)                        509
Fargo (1996)                          508
Return of the Jedi (1983)             507
Liar Liar (1997)                      485
                                     ...
Great Day in Harlem, A (1994)           1
Other Voices, Other Rooms (1997)        1
Good Morning (1971)                     1
Girls Town (1996)                       1
Á köldum klaka (Cold Fever) (1994)      1
Name: ratting, Length: 1664, dtype: int64

In [37]:
rattings=pd.DataFrame(df.groupby('title')['ratting'].mean())

In [38]:
rattings.head()

                            ratting
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

add a new columns of numbers of rattings

In [40]:
rattings['number_of_ratting']=pd.DataFrame(df.groupby('title')['ratting'].count())

In [41]:
rattings.head()

                            ratting  number_of_ratting
title
'Til There Was You (1997)  2.333333                  9
1-900 (1994)               2.600000                  5
101 Dalmatians (1996)      2.908257                109
12 Angry Men (1957)        4.344000                125
187 (1997)                 3.024390                 41